<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class AnswerTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $students = [
            // あおぞら１８
            1801 => 'つくし',
            1802 => 'ハク',
            1803 => 'すぅ',
            1804 => 'クラリ',
            1805 => 'レックス',
            1806 => 'わくわくさん',
            1807 => 'やっつびー',
            // しおかぜ１８
            1811 => 'はつね',
            1812 => 'チャップ',
            1813 => 'ももたろう',
            1814 => 'パラボラ',
            1815 => 'ざんまいまい',
            1816 => 'ポックル',
            1817 => 'バッカス',
            // うぐいす１８
            1821 => 'ローザ',
            1822 => 'おじょう',
            1823 => 'イヴァンカ',
            1824 => 'あずき',
            1824 => 'ゾロ',
            1825 => 'トミー',
            1826 => 'パボ',
            1827 => 'バース',
            // なかよし１８
            1831 => 'ちとせ',
            1832 => 'モカ',
            1833 => 'ニイナ',
            1834 => 'つきみ',
            1835 => 'もうない',
            1836 => 'ちょこぴー',
            1837 => 'ZOO',
            1838 => 'まめきち',
            1839 => 'セロ',
            // あおぞら１９
            1901 => 'ゆきみ',
            1902 => 'のん',
            1903 => 'みんと',
            1904 => 'メープル',
            // しおかぜ１９
            1905 => 'ばかぼん',
            1911 => 'みかん',
            1912 => 'すずめ',
            1913 => 'ココ',
            1914 => 'もりぞう',
            // うぐいす１９
            1921 => 'れーわ',
            1922 => 'リッツ',
            1923 => 'おひや',
            1924 => 'アリス',
            1925 => 'しろちゃん',
            // なかよし１９
            1931 => 'ちゃま',
            1932 => 'ブラン',
            1933 => 'ベル',
            1934 => 'ぽっぽ',
            1935 => 'レイニー',
            // あおぞら２０
            2001 => 'たんたん',
            2002 => 'ぷく',
            2003 => 'すいみー',
            2004 => 'ささまる',
            2005 => 'フェルナンド',
            // しおかぜ２０
            2011 => 'ちょもたん',
            2012 => 'チコ',
            2013 => 'もちまる',
            2014 => 'ぽん',
            2015 => 'みなみ',
            // うぐいす２０
            2021 => 'リーフ',
            2022 => 'ルー',
            2023 => 'ささら',
            2024 => 'いろは',
            2025 => 'モネ',
            // なかよし２０
            2031 => '極-KIWAMI-',
            2032 => 'コレット',
            2033 => 'パッチ',
            2034 => 'みょん'
        ];
        $toya = [
            'line_id' => 'U10965498ae8ae91064c0ee46a7f192e7',
            'line_name' => '千葉陶也'
        ];
        for ($t = 10; $t <= 40; $t++) {
            $toya = array_merge($toya, array('q' . strval($t) => array_rand($students)));
        }
        DB::table('answers')->insert($toya);

        for ($i = 1; $i <= 30; $i++) {
            $data = [
                'line_id' => 'test',
                'line_name' => 'test',
            ];
            for ($t = 10; $t <= 40; $t++) {
                $data = array_merge($data, array('q' . strval($t) => array_rand($students)));
            }
            DB::table('answers')->insert($data);
        }
    }
}
